
# pages/about.py

import streamlit as st

st.set_page_config(page_title="ℹ️ عن المشروع", layout="wide")
st.title("ℹ️ معلومات عن مشروع التشخيص بالذكاء الاصطناعي")

st.markdown("""
### فكرة المشروع:
تحليل بيانات حساس السيارة والتنبؤ بكود العطل المحتمل باستخدام الذكاء الاصطناعي (Random Forest).

### مراحل المشروع:
1. رفع وتحليل البيانات.
2. تدريب النموذج على ملف carset.
3. التنبؤ بالأكواد بناءً على بيانات الحساسات.
4. عرض الرسوم البيانية لتوضيح الانحرافات.

### developer:
**Nabil elmasry ®🤙 01211259721**
""")
